<template>
  <v-card flat class="mt-15">
    <p class="text-h2 font-weight-bold mb-2">역사</p>
    <v-timeline>
      <v-timeline-item
        v-for="(history, i) in histories"
        :key="i"
        :color="history.color"
        small
      >
        <template v-slot:opposite>
          <span
            :class="`headline font-weight-bold ${history.color}--text`"
            v-text="history.title"
          ></span>
        </template>
        <div class="py-4">
          <h2 :class="`headline font-weight-light mb-4 ${history.color}--text`">
            {{ history.title }}
          </h2>
          <div>
            {{ history.content }}
          </div>
        </div>
      </v-timeline-item>
    </v-timeline>
    <p class="text-right">
      출처 : 대한태권도협회
    </p>
  </v-card>
</template>

<script>
export default {
  name: "History",
  data() {
    return {
      histories: [
        {
          color: "lime",
          title: "태권도의 연원(淵源)",
          content:
            "한반도와 중국 대륙의 동쪽 만주 주변 한민족의 부족국가에서는 영고, 무천, 동맹 등으로 불리운 지례에서 하늘을 숭상하는 가무, 유희 오락을 통해 부족 단합과 많은 수확을 기원했다. 이런 큰 잔치 중의 가무, 유희는 자연스럽게 경쟁의식을 갖게 되어 고대 그리스인들의 신전제례 행상인 올림피아 제천처럼 경기적 성격을 갖게 되었다. 부족의 방어와 세력확대를 위해서는 전투능력 향상을 도모해야했으며, 자연스럽게 승천 제례의 신체활동은 투기를 중심으로 경기화되고 발달하게 되었다. 태권도는 이런 가운데 한민족 고유의 투기 형태로 생성되었다."
        },
        {
          color: "green",
          title: "고대시대",
          content:
            "여러 개의 부족국가가 점차 흡수·통합되어 한민족은 고구려(BC 37), 백제(BC 18), 신라(BC 57)의 3개국으로 나뉘어 중국 대륙의 동북방과 한반도를 지배했다. 택견, 수박으로 불리던 태권도 무예 수련의 기초로 당시에 널리 행해졌으며 고구려는 '선배',신라는 '화랑'이라는 청소년 집단교육제도를 창안하여 이들은 산천을 주유하며 무예 수련을 했다. 고대의 태권도에 관한 사료에는 고분벽화, 불상 그리고 서적의 기독 등이 남아있다. 고분벽화 중의 하나로 AD 209~AD 427년 당시의 고구려의 수도였던 환도성 근처인 현재 만주 통화성 집안현 통구에 있는 무용총 현실 벽화가 있다. 이 벽화는 두 사람이 일정한 간격을 두고 마주 보며·발로 상대를 공격할 듯한 자세를 보여 오늘날의 태권도 경기 동작과 유사함을 보이고 있다. 또 신라 문화예술의 정화로 일컫는 석굴암의 금강역사상이나 분황사 9층 석탑의 인왕상 등의 몸 사위는 태권도의 품을 보이고 있다. 특히, 국가의 멸망으로 사료가 단절된 백제의 경우에는 일본서기에 백제의 대좌평 지적을 일본 조정에서 초청해 일본 건아들과 상박을 했다는 기록이 남아 있어 당시 일본인에게 선진 문화권인 백제인들이 맨 손 무예를 지도했다는 것을 알 수 있다."
        },
        {
          color: "primary",
          title: "중세시대",
          content:
            "고려에와서는 삼국시대에 행해지던 택견(태권도)이 체계화된 무예로서 문인들 사이에서 활발히 행해졌다. 고려사에 보면 태권도가 박희로 기록되어 있다. 고려사권 128, 열전41, 이의민에 보면 '이의민은 수박 희를 매우 잘 하므로 의종 임금은 이를 사랑하여 대정에서 별정으로 승진시켰다'라는 구절이 있다. 또 '임금이 상춘정에 납시어 수박희를 보셨다.''임금이 화비궁에서 수박희를 보셨다.''말바위에 납시어 수박희를 보셨다.'라는 고려사 권 36 충혜왕의 기록도 있다. 고려 때에 있어 수박희(태권도)는 무예로서 뿐만 아니라 스포츠로서 제 삼자가 관람 할 수 있을 정도로 체계가 서 있던 것으로 생각할 수 있다."
        },
        {
          color: "pink",
          title: "근세시대",
          content:
            "조선에 와서도 고려 때와 비슷하게 무인들 사이에 수박희(태권도)가 계속 성행했다. 더욱이 대중화 경기로 되면서 백성들 사이에서도 경기를 행하게 되었다. 전라도와 충청도 경계를 이루는 작지 마을에서 양도 사람들이 모여 수박희로서 승부를 다투었다는 기록에서 수박희는 무예로서만이 아니라 스포츠로서도 성행한 것을 알 수 있다. 또 태종실록 권 19에 보면 '병조의 의흥부에서 수박희로서 인재를 시험하여 방패군에 보하되 3인을 이긴자를 썼다.'라는 기록이 있으며, '임금이 잔치를 베풀고 군사로 하여금 수박희를 행하도록 하고 구경했다.'(태종실록 32)는 기록도 있는 것이다. 뿐만 아니라 수박희는 실전에서도 사용되었다. 기제잡기 권 7의 임진일록에 보면 '금산에서 적군(왜병)이 몰려오니 우리의 의병들은 무기가 떨어져 할 수 없이 맨손으로 수박희 싸움으로 적과 대결하다가 의병장 조헌도 죽고 영규도 싸움터에서 죽었다.'는 기록이 있다. 조선시대 태권도 사료 중 하나로서는 정조 때 간행된 종합무예기술서인 무예도보통지의 권법이 오늘에까지 전래되고 있다."
        },
        {
          color: "dark",
          title: "현대시대",
          content:
            "국운 쇠퇴와 더불어 무인들의 몰락은 군대의 해체 등으로 가속화되었고 일제는 강압적인 무력침략을 통해 한국을 식민지로 만들었다. 일제의 한민족 탄압이 강회되기 시작하고 항쟁의 수단으로 사용될 수 있는 백성들의 무예수련은 금지되었다. 그러나 독립군, 광복군 등 항일조직의 심신 훈련방법으로써나 개인적인 무예 전승 의욕에 따라 태권도(택견)의 명맥은 미미하지만 민족의 숨결속에 이어지고 있었다. 8.15 해방 후 잊혀진 우리의 태권도를 되찾자는 뜻 있는 이들이 모여서 후진을 양성하였으며 점차 우리의 뿌리를 찾아가게 되어 드디어 1961년 9월 16일 대한태권도협회가 창설되고 1963년 2월 23일 대한 체육회에 27번째 가맹단체로 가입되어 1963년 10월 9일 전주에서 개최된 제 44회 전국체전에 태권도가 공식 경기로 처음 참가하게 되었다. 오늘날 인류의 스포츠제전인 올림픽대에서까지 각광받고 있는 태권도 경기는 바로 25년전인 1963년의 전국체육대회를 계기로 경기 규칙과 보호용구가 비약적으로 발전하기 시작했다."
        }
      ]
    };
  }
};
</script>

<style></style>
